{
  "info": {
    "name": "Emanuel Laiolo",
    "title": "Young Developer / Entrepreneur / AIpreneur",
    "location": "Kraków, Poland",
    "email": "emalaiolo@gmail.com",
    "linkedin": "https://www.linkedin.com/in/emanuel-laiolo-300b31313",
    "github": "https://github.com/Emanuel-Laiolo/CvGenerator"
  },
  "summary": "Full Stack Developer specialized in high-performance web applications and algorithmic logic. Proven experience in developing and commercializing complex software solutions for data analysis and risk management.",
  "about": "Full Stack Developer and Data Analyst with over 6 years of experience. I specialize in building scalable web applications and implementing complex algorithmic logic. I combine strong foundational knowledge in data structures with a modern, high-performance stack (React, Node.js, Python). I actively integrate advanced AI tools into my workflow.\n\n*Note: Since my projects are commercial products (proprietary software), the source code is hosted in private repositories. However, I am happy to provide code walkthroughs and live demonstrations of the platforms during an interview.*",
  "skills": [
    {
      "category": "Development Stack",
      "details": [
        "React, TypeScript, Vite, Tailwind CSS, Framer Motion",
        "Node.js, PostgreSQL, Supabase, SQL, Stripe, Cloudflare Stream"
      ]
    },
    {
      "category": "Tools & Platforms",
      "details": [
        "Visual Studio Code, GitHub, Git Version Control",
        "Shopify (E-commerce Development), Vercel"
      ]
    },
    {
      "category": "Automation & Logic",
      "details": [
        "Python (Desktop GUIs/Tkinter), Game Theory (GTO), Algorithms",
        "Workflow Optimization with LLMs (Claude, Gemini, Copilot)"
      ]
    },
    {
      "category": "Foundational Tech",
      "details": [
        "C, C++, Java, PHP, SQL, Data Structures"
      ]
    },
    {
      "category": "Languages",
      "details": [
        "Spanish (Native), English (Fluent)"
      ]
    }
  ],
  "experience": [
    {
      "role": "Co-founder",
      "company": "Yoga4Poker",
      "dates": "Feb. 2025 - Present",
      "description": "High-performance training program bridging the gap between mental well-being and professional gaming. Co-developed a specialized curriculum combining neuroscience and yoga to optimize cognitive load and led the digital strategy/market positioning.",
      "stack": "Entrepreneurship, Product Strategy, Strategic Vision."
    },
    {
      "role": "Lead Full Stack Developer",
      "company": "YogaLorena.com",
      "dates": "Nov. 2025 - Dec. 2025",
      "description": "Architected and built a scalable Video-on-Demand platform featuring automated subscription billing (Stripe), secure high-quality video streaming (Cloudflare), and a custom course progression system. Managed the full lifecycle from design to deployment.",
      "stack": "React, TypeScript, Vite, PostgreSQL, Stripe, Resend."
    },
    {
      "role": "Software Developer & Entrepreneur",
      "company": "Poker Strategy Software Solutions",
      "dates": "May 2023 - Aug. 2024",
      "description": "Engineered and commercialized a sophisticated desktop application for elite-level Game Theory (GTO) study. The software provides deep analysis capabilities and a visual grid editor for constructing complex mixed strategies.",
      "stack": "Python, Tkinter (GUI), JSON, Algorithmic Logic, Statistics."
    },
    {
      "role": "Algorithmic Data Analyst",
      "company": "Independent Consultant",
      "dates": "Mar. 2022 - Apr. 2023",
      "description": "Designed and sold bespoke mathematical bankroll management systems. Utilized solvers and multi-terabyte databases to predict Equity, EV, and risk, enabling clients to optimize their investment strategies.",
      "stack": "SQL, Big Data, Statistics & Probability, Solvers."
    }
  ],
  "education": [
    {
      "institution": "Universidad Tecnológica Nacional (UTN)",
      "degree": "University Technician in Programming",
      "year": "2025 - 2027",
      "description": "Current studies in Software Development and Programming Logic at UTN, Argentina."
    },
    {
      "institution": "Instituto Don Bosco (Bahía Blanca)",
      "degree": "Bachelor of Social Sciences",
      "year": "2010 - 2017",
      "description": "Secondary education with a focus on Social Sciences."
    },
    {
      "degree": "Continuous Learning",
      "institution": "Self-taught",
      "year": "Ongoing",
      "description": "Constant research and application of AI technologies for software engineering (LLMs, Code Optimization)."
    }
  ]
}